FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ПрайсЛистыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентов</Name>
			<Comment>Прайс-листы контрагентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции в валюте прайслиста</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставкиМаксимальный</Name>
					<Comment>Максимальный срок поставки до склада поставщика (в секундах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючСтрокиПоставщика</Name>
					<Comment>Код, ключ строки поставщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТегПозиции</Name>
					<Comment>Тег позиции (группа скидки и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта цены в прайс-листе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставкиМинимальный</Name>
					<Comment>Минимальный срок поставки до склада поставщика (в секундах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Представление срока поставки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент прайс-листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВПрайсЛисте</Name>
					<Comment>Производитель, как он указан в прайс-листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура прайс-листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Преобразованный артикул для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель детали</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Comment>Дата создания записи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПредложения</Name>
					<Comment>Порядковый номер позиции в файле</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыПрайсЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПрайсЛистов</Name>
			<Comment>Виды прайс листов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛистПоставщика</Name>
					<Comment>Прайс-лист поставщика</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогПредложений</Name>
					<Comment>Файл с данными в виде каталога предложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиДляКаталогаПредложений</Name>
					<Comment>Данные об остатках для каталога предложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебПрайсЛист</Name>
					<Comment>Данные из веб-прайс-листа поставщика</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ПрайсЛистыКонтрагентов/Ext/ManagerModule.bsl
//Процедура заполняет артикул, дату записи и преобразует артикул для поиска
Процедура ЗаполнитьАртикулДляПоиска() Экспорт 
	
	#Если Клиент Тогда
	Состояние(НСтр("ru='Проверка прайс-листов контрагентов.'"));
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрайсЛистыКонтрагентов.Производитель КАК Производитель,
		|	ПрайсЛистыКонтрагентов.ПрайсЛист КАК ПрайсЛист,
		|	ПрайсЛистыКонтрагентов.ДатаЗаписи
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
		|ГДЕ
		|	НЕ ПрайсЛистыКонтрагентов.АртикулДляПоиска = """"
		|	И ПрайсЛистыКонтрагентов.Артикул = """"
		|	И ПрайсЛистыКонтрагентов.ДатаЗаписи = ДАТАВРЕМЯ(1, 1, 1)";
				   
	Результат = Запрос.Выполнить();
				   
	Если Результат.Пустой() Тогда
		#Если Клиент Тогда
		Сообщить(НСтр("ru='Обновление регистра сведений ""Прайс-листы контрагентов"" не требуется'"));
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Прайс-листы контрагентов""'"));
	#КонецЕсли
	
	Выборка = Результат.Выбрать(); 
	
	РазмерВыборки	= Выборка.Количество();
	РазмерПорции	= Окр(100/РазмерВыборки);
	СчВыборки		= 0;
	ПроцентПрогресса = 0;
	
	Пока Выборка.Следующий()Цикл
		СчВыборки = СчВыборки + 1;
		
		НачатьТранзакцию();
		
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.	 Установить(Выборка.ПрайсЛист,		Истина);
		НаборЗаписей.Отбор.ДатаЗаписи.	 Установить(Выборка.ДатаЗаписи,		Истина);
		НаборЗаписей.Отбор.Производитель.Установить(Выборка.Производитель,	Истина);
		
		НаборЗаписей.Прочитать();
		
		ТабНабора = НаборЗаписей.Выгрузить();
		
		НаборЗаписей.Очистить();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		
		ПорцияЗаписей = ТабНабора.СкопироватьКолонки();
		ПорцияЗаписей.Индексы.Добавить("АртикулДляПоиска,Номенклатура");
		
		ДатаЗаписи = ТекущаяДата();
		
		РазмерНабора  = ТабНабора.Количество();
		СчНабора = 0;
		
		Пока ТабНабора.Количество() > 0 Цикл 
			Если ДатаЗаписи > ТекущаяДата() Тогда
				ДатаЗаписи = ДатаЗаписи + 1;
			Иначе
				ДатаЗаписи = ТекущаяДата();
			КонецЕсли;
			
			Сч = 0;
			Пока ТабНабора.Количество() > Сч Цикл
				
				СчНабора = СчНабора + 1;
				
				#Если Клиент Тогда
				Если Цел(Окр(СчНабора * РазмерПорции / РазмерНабора) + (РазмерПорции * (СчВыборки-1))) > ПроцентПрогресса Тогда
					ПроцентПрогресса = Цел(Окр(СчНабора * РазмерПорции / РазмерНабора) + (РазмерПорции * (СчВыборки-1)));
					Состояние(НСтр("ru='Обновление регистра сведений ""Прайс-листы контрагентов"": '") + Строка(ПроцентПрогресса)+"%");
				КонецЕсли;
				#КонецЕсли
				
				Если ПорцияЗаписей.Количество() > 10000 Тогда
					НаборЗаписей.Отбор.ДатаЗаписи.Установить(ДатаЗаписи, Истина);
					НаборЗаписей.Загрузить(ПорцияЗаписей);
					НаборЗаписей.ОбменДанными.Загрузка = Истина;
					НаборЗаписей.Записать();
					Если ДатаЗаписи > ТекущаяДата() Тогда
						ДатаЗаписи = ДатаЗаписи + 1;
					Иначе
						ДатаЗаписи = ТекущаяДата();
					КонецЕсли;
					ПорцияЗаписей.Очистить();
					Сч = 0;
					Продолжить;
				КонецЕсли;
				
				ИсходнаяСтрока = ТабНабора[Сч];
				
				Артикул			 = ИсходнаяСтрока.АртикулДляПоиска;
				АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Артикул, ИсходнаяСтрока.Производитель);
				
				Если ПустаяСтрока(АртикулДляПоиска)Тогда
					АртикулДляПоиска = Артикул;
				КонецЕсли;
				
				Если ПорцияЗаписей.НайтиСтроки(Новый Структура("АртикулДляПоиска,Номенклатура", АртикулДляПоиска, ИсходнаяСтрока.Номенклатура)).Количество() > 0 Тогда
					Сч = Сч + 1;
					СчНабора = СчНабора - 1;
					Продолжить;
				КонецЕсли;
				
				СтрокаПорции = ПорцияЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПорции, ИсходнаяСтрока);
				СтрокаПорции.ДатаЗаписи = ДатаЗаписи;
				СтрокаПорции.АртикулДляПоиска = АртикулДляПоиска;
				СтрокаПорции.Артикул = Артикул;
				ТабНабора.Удалить(ИсходнаяСтрока);
				
			КонецЦикла;
			    				
			Если ПорцияЗаписей.Количество() > 0 Тогда
				НаборЗаписей.Отбор.ДатаЗаписи.Установить(ДатаЗаписи, Истина);
				НаборЗаписей.Загрузить(ПорцияЗаписей);
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать();
			КонецЕсли;
			
			ПорцияЗаписей.Очистить();
			
		КонецЦикла;
					
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Прайс-листы контрагентов"" завершено.'"));
	#КонецЕсли
	
КонецПроцедуры //ЗаполнитьАртикулДляПоиска()

//Возвращает данные из прайс-листов по переданной номенклатуре
Функция ПолучитьПрайсЛистыКонтрагентов(Артикул_Номенклатура, Производитель=Неопределено, Поставщик=Неопределено, ДатаЦен=Неопределено, ПодразделениеКомпании=Неопределено) Экспорт 
	
	Если ДатаЦен = Неопределено Тогда
		ДатаЦен = ТекущаяДата();
	КонецЕсли;
	
	Контрагент = Неопределено;
	ПрайсЛистКонтрагента = Неопределено;
	
	Если ТипЗнч(Поставщик) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = Поставщик;
	ИначеЕсли ТипЗнч(Поставщик) = Тип("СправочникСсылка.ПрайсЛистыКонтрагентов") Тогда
		ПрайсЛистКонтрагента = Поставщик;
	ИначеЕсли ТипЗнч(Поставщик) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛистКонтрагента);
	Запрос.УстановитьПараметр("Дата", ДатаЦен);
	Если ТипЗнч(Производитель) = Тип("Строка") Тогда
		Запрос.УстановитьПараметр("ПроизводительВПрайсЛисте", Производитель);
	КонецЕсли;
	
	ЭтоВебПрайсЛист = ЗначениеЗаполнено(ПрайсЛистКонтрагента) И ПрайсЛистКонтрагента.ВидПрайсЛиста = Перечисления.ВидыПрайсЛистов.ВебПрайсЛист;
	
	Если ТипЗнч(Артикул_Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПравилаЗагрузки.ПрайсЛист,
		|	ВЫРАЗИТЬ(ПравилаЗагрузки.ОбъектПравила КАК СТРОКА(32)) КАК КлючСтроки
		|ПОМЕСТИТЬ втПравилаЗагрузки
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения КАК ЗапрещенныеПодразделения
		|		ПО ПравилаЗагрузки.ПрайсЛист = ЗапрещенныеПодразделения.ПрайсЛист
		|			И ("+?(ЗначениеЗаполнено(ПодразделениеКомпании), "ЗапрещенныеПодразделения.ПодразделениеКомпании = &ПодразделениеКомпании", "ЛОЖЬ")+"
		|				ИЛИ ЗапрещенныеПодразделения.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))
		|ГДЕ
		|	(ВЫРАЗИТЬ(ПравилаЗагрузки.Значение КАК Справочник.Номенклатура)) = &Номенклатура
		|	И ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.КлючСтроки)
		|	И ПравилаЗагрузки.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.ПрисвоитьЗначение)
		|	И ПравилаЗагрузки.ИмяРеквизитаПрайсЛиста = ""Номенклатура""
		|	"+?(ЗначениеЗаполнено(Контрагент), "И ПравилаЗагрузки.ПрайсЛист.Владелец = &Контрагент", "")+"
		|	"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист", "")+"
		|	И ЗапрещенныеПодразделения.ПрайсЛист ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрайсЛистыКонтрагентов.Артикул,
		|	ПрайсЛистыКонтрагентов.Производитель,
		|	ПрайсЛистыКонтрагентов.Наименование,
		|	ПрайсЛистыКонтрагентов.НаименованиеИностранное,
		|	ПрайсЛистыКонтрагентов.Количество,
		|	ПрайсЛистыКонтрагентов.ПрайсЛист,
		|	ПрайсЛистыКонтрагентов.Цена КАК Цена,
		|	ПрайсЛистыКонтрагентов.Валюта,
		|	ПрайсЛистыКонтрагентов.СрокПоставки,
		|	ПрайсЛистыКонтрагентов.СрокПоставкиМинимальный,
		|	ПрайсЛистыКонтрагентов.КлючСтрокиПоставщика,
		|	ПрайсЛистыКонтрагентов.ТегПозиции
		|ПОМЕСТИТЬ втПозицииПрайсЛистов
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов"+?(ЭтоВебПрайсЛист И ТипЗнч(Производитель) = Тип("Строка"), "Временный", "")+" КАК ПрайсЛистыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения КАК ЗапрещенныеПодразделения
		|		ПО ПрайсЛистыКонтрагентов.ПрайсЛист = ЗапрещенныеПодразделения.ПрайсЛист
		|			И ("+?(ЗначениеЗаполнено(ПодразделениеКомпании), "ЗапрещенныеПодразделения.ПодразделениеКомпании = &ПодразделениеКомпании", "ЛОЖЬ")+"
		|				ИЛИ ЗапрещенныеПодразделения.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))
		|ГДЕ
		|	ПрайсЛистыКонтрагентов.АртикулДляПоиска <> """"
		|	И ПрайсЛистыКонтрагентов.АртикулДляПоиска = &АртикулДляПоиска
		|	И ПрайсЛистыКонтрагентов.Производитель = &Производитель
		|	"+?(ЗначениеЗаполнено(Контрагент), "И ПрайсЛистыКонтрагентов.ПрайсЛист.Владелец = &Контрагент", "")+"
		|	"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист", "")+"
		|	"+?(ТипЗнч(Производитель) = Тип("Строка"), "И ПрайсЛистыКонтрагентов.ПроизводительВПрайсЛисте = &ПроизводительВПрайсЛисте", "")+"
		|	И ЗапрещенныеПодразделения.ПрайсЛист ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПрайсЛистыКонтрагентов.Артикул,
		|	ПрайсЛистыКонтрагентов.Производитель,
		|	ПрайсЛистыКонтрагентов.Наименование,
		|	ПрайсЛистыКонтрагентов.НаименованиеИностранное,
		|	ПрайсЛистыКонтрагентов.Количество,
		|	ПрайсЛистыКонтрагентов.ПрайсЛист,
		|	ПрайсЛистыКонтрагентов.Цена,
		|	ПрайсЛистыКонтрагентов.Валюта,
		|	ПрайсЛистыКонтрагентов.СрокПоставки,
		|	ПрайсЛистыКонтрагентов.СрокПоставкиМинимальный,
		|	ПрайсЛистыКонтрагентов.КлючСтрокиПоставщика,
		|	ПрайсЛистыКонтрагентов.ТегПозиции
		|ИЗ
		|	втПравилаЗагрузки КАК ПравилаЗагрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентов"+?(ЭтоВебПрайсЛист И ТипЗнч(Производитель) = Тип("Строка"), "Временный", "")+" КАК ПрайсЛистыКонтрагентов
		|		ПО ПравилаЗагрузки.ПрайсЛист = ПрайсЛистыКонтрагентов.ПрайсЛист
		|			И ПравилаЗагрузки.КлючСтроки = ПрайсЛистыКонтрагентов.КлючСтрокиПоставщика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втПравилаЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииПрайсЛистов.ПрайсЛист,
		|	ПозицииПрайсЛистов.Артикул,
		|	ПозицииПрайсЛистов.Производитель,
		|	ПозицииПрайсЛистов.Наименование,
		|	ПозицииПрайсЛистов.ТегПозиции,
		|	ПозицииПрайсЛистов.Количество,
		|	ПозицииПрайсЛистов.Цена КАК ЦенаВПрайсЛисте,
		|	ПозицииПрайсЛистов.Цена * (100 - ЕСТЬNULL(Скидки.Скидка, ЕСТЬNULL(СкидкиТегПозиции.Скидка, ЕСТЬNULL(СкидкиПроизводитель.Скидка, ЕСТЬNULL(СкидкиБазовые.Скидка, 0))))) / 100 КАК Цена,
		|	ПозицииПрайсЛистов.Валюта,
		|	ПозицииПрайсЛистов.Цена * (100 - ЕСТЬNULL(Скидки.Скидка, ЕСТЬNULL(СкидкиТегПозиции.Скидка, ЕСТЬNULL(СкидкиПроизводитель.Скидка, ЕСТЬNULL(СкидкиБазовые.Скидка, 0))))) * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1) / 100 КАК ЦенаРег,
		|	ПозицииПрайсЛистов.СрокПоставки,
		|	ПозицииПрайсЛистов.СрокПоставкиМинимальный,
		|	ПозицииПрайсЛистов.ПрайсЛист.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ПозицииПрайсЛистов.ПрайсЛист.СтавкаНДС КАК СтавкаНДС,
		|	ПозицииПрайсЛистов.НаименованиеИностранное,
		|	ПозицииПрайсЛистов.КлючСтрокиПоставщика
		|ИЗ
		|	втПозицииПрайсЛистов КАК ПозицииПрайсЛистов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ПрайсЛист В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						втПозицииПрайсЛистов.ПрайсЛист
		|					ИЗ
		|						втПозицииПрайсЛистов)) КАК Скидки
		|		ПО (НЕ Скидки.Отменена)
		|			И ПозицииПрайсЛистов.ПрайсЛист = Скидки.ПрайсЛист
		|			И ПозицииПрайсЛистов.ТегПозиции = Скидки.ТегПозиции
		|			И ПозицииПрайсЛистов.Производитель = Скидки.Производитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ПрайсЛист В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						втПозицииПрайсЛистов.ПрайсЛист
		|					ИЗ
		|						втПозицииПрайсЛистов)
		|					И ТегПозиции <> """"
		|					И Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|					) КАК СкидкиТегПозиции
		|		ПО (НЕ СкидкиТегПозиции.Отменена)
		|			И ПозицииПрайсЛистов.ПрайсЛист = СкидкиТегПозиции.ПрайсЛист
		|			И ПозицииПрайсЛистов.ТегПозиции = СкидкиТегПозиции.ТегПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ПрайсЛист В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						втПозицииПрайсЛистов.ПрайсЛист
		|					ИЗ
		|						втПозицииПрайсЛистов)
		|					И ТегПозиции = """"
		|					И Производитель <> ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|					) КАК СкидкиПроизводитель
		|		ПО (НЕ СкидкиПроизводитель.Отменена)
		|			И ПозицииПрайсЛистов.ПрайсЛист = СкидкиПроизводитель.ПрайсЛист
		|			И ПозицииПрайсЛистов.Производитель = СкидкиПроизводитель.Производитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ПрайсЛист В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							втПозицииПрайсЛистов.ПрайсЛист
		|						ИЗ
		|							втПозицииПрайсЛистов)
		|					И ТегПозиции = """"
		|					И Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|					) КАК СкидкиБазовые
		|		ПО (НЕ СкидкиБазовые.Отменена)
		|			И ПозицииПрайсЛистов.ПрайсЛист = СкидкиБазовые.ПрайсЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалют
		|		ПО ПозицииПрайсЛистов.Валюта = КурсыВалют.Валюта
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаРег, СрокПоставкиМинимальный
		|";
		
		Запрос.УстановитьПараметр("Номенклатура", Артикул_Номенклатура);
		Запрос.УстановитьПараметр("АртикулДляПоиска", Артикул_Номенклатура.АртикулДляПоиска);
		Запрос.УстановитьПараметр("Производитель", Артикул_Номенклатура.Производитель);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрайсЛистыКонтрагентов.ПрайсЛист,
		|	ПрайсЛистыКонтрагентов.Артикул,
		|	ПрайсЛистыКонтрагентов.Производитель,
		|	ПрайсЛистыКонтрагентов.Наименование,
		|	ПрайсЛистыКонтрагентов.ТегПозиции,
		|	ПрайсЛистыКонтрагентов.Количество,
		|	ПрайсЛистыКонтрагентов.Цена КАК ЦенаВПрайсЛисте,
		|	ПрайсЛистыКонтрагентов.Цена * (100 - ЕСТЬNULL(Скидки.Скидка, ЕСТЬNULL(СкидкиТегПозиции.Скидка, ЕСТЬNULL(СкидкиПроизводитель.Скидка, ЕСТЬNULL(СкидкиБазовые.Скидка, 0))))) / 100 КАК Цена,
		|	ПрайсЛистыКонтрагентов.Валюта,
		|	ПрайсЛистыКонтрагентов.Цена * (100 - ЕСТЬNULL(Скидки.Скидка, ЕСТЬNULL(СкидкиТегПозиции.Скидка, ЕСТЬNULL(СкидкиПроизводитель.Скидка, ЕСТЬNULL(СкидкиБазовые.Скидка, 0))))) * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1) / 100 КАК ЦенаРег,
		|	ПрайсЛистыКонтрагентов.СрокПоставки,
		|	ПрайсЛистыКонтрагентов.СрокПоставкиМинимальный КАК СрокПоставкиМинимальный,
		|	ПрайсЛистыКонтрагентов.ПрайсЛист.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ПрайсЛистыКонтрагентов.ПрайсЛист.СтавкаНДС КАК СтавкаНДС,
		|	ПрайсЛистыКонтрагентов.НаименованиеИностранное,
		|	ПрайсЛистыКонтрагентов.КлючСтрокиПоставщика
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов"+?(ЭтоВебПрайсЛист И ТипЗнч(Производитель) = Тип("Строка"), "Временный", "")+" КАК ПрайсЛистыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения КАК ЗапрещенныеПодразделения
		|		ПО ПрайсЛистыКонтрагентов.ПрайсЛист = ЗапрещенныеПодразделения.ПрайсЛист
		|			И ("+?(ЗначениеЗаполнено(ПодразделениеКомпании), "ЗапрещенныеПодразделения.ПодразделениеКомпании = &ПодразделениеКомпании", "ЛОЖЬ")+"
		|				ИЛИ ЗапрещенныеПодразделения.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ИСТИНА
		|					"+?(ЗначениеЗаполнено(Контрагент), "И ПрайсЛист.Владелец = &Контрагент", "")+"
		|					"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПрайсЛист = &ПрайсЛист", "")+"
		|					) КАК Скидки
		|		ПО (НЕ Скидки.Отменена)
		|			И ПрайсЛистыКонтрагентов.ПрайсЛист = Скидки.ПрайсЛист
		|			И ПрайсЛистыКонтрагентов.ТегПозиции = Скидки.ТегПозиции
		|			И ПрайсЛистыКонтрагентов.Производитель = Скидки.Производитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ИСТИНА
		|					"+?(ЗначениеЗаполнено(Контрагент), "И ПрайсЛист.Владелец = &Контрагент", "")+"
		|					"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПрайсЛист = &ПрайсЛист", "")+"
		|					И ТегПозиции <> """"
		|					И Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|					) КАК СкидкиТегПозиции
		|		ПО (НЕ СкидкиТегПозиции.Отменена)
		|			И ПрайсЛистыКонтрагентов.ПрайсЛист = СкидкиТегПозиции.ПрайсЛист
		|			И ПрайсЛистыКонтрагентов.ТегПозиции = СкидкиТегПозиции.ТегПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ИСТИНА
		|					"+?(ЗначениеЗаполнено(Контрагент), "И ПрайсЛист.Владелец = &Контрагент", "")+"
		|					"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПрайсЛист = &ПрайсЛист", "")+"
		|					И ТегПозиции = """"
		|					И Производитель <> ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|					) КАК СкидкиПроизводитель
		|		ПО (НЕ СкидкиПроизводитель.Отменена)
		|			И ПрайсЛистыКонтрагентов.ПрайсЛист = СкидкиПроизводитель.ПрайсЛист
		|			И ПрайсЛистыКонтрагентов.Производитель = СкидкиПроизводитель.Производитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
		|				&Дата,
		|				ИСТИНА
		|					"+?(ЗначениеЗаполнено(Контрагент), "И ПрайсЛист.Владелец = &Контрагент", "")+"
		|					"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПрайсЛист = &ПрайсЛист", "")+"
		|					И ТегПозиции = """"
		|					И Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
		|			) КАК СкидкиБазовые
		|		ПО (НЕ СкидкиБазовые.Отменена)
		|			И ПрайсЛистыКонтрагентов.ПрайсЛист = СкидкиБазовые.ПрайсЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалют
		|		ПО ПрайсЛистыКонтрагентов.Валюта = КурсыВалют.Валюта
		|ГДЕ
		|	ПрайсЛистыКонтрагентов.АртикулДляПоиска <> """"
		|	И ПрайсЛистыКонтрагентов.АртикулДляПоиска В (&СписокАртикулов)
		|	"+?(Производитель <> Неопределено, "И ПрайсЛистыКонтрагентов.Производитель = &Производитель", "")+"
		|	"+?(ЗначениеЗаполнено(Контрагент), "И ПрайсЛистыКонтрагентов.ПрайсЛист.Владелец = &Контрагент", "")+"
		|	"+?(ЗначениеЗаполнено(ПрайсЛистКонтрагента), "И ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист", "")+"
		|	"+?(ТипЗнч(Производитель) = Тип("Строка"), "И ПрайсЛистыКонтрагентов.ПроизводительВПрайсЛисте = &ПроизводительВПрайсЛисте", "")+"
		|	И ЗапрещенныеПодразделения.ПрайсЛист ЕСТЬ NULL 
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаРег, СрокПоставкиМинимальный
		|";
		
		АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Артикул_Номенклатура);
		СписокАртикулов = Новый СписокЗначений;
		СписокАртикулов.Добавить(Артикул_Номенклатура);
		Если АртикулДляПоиска <> Артикул_Номенклатура Тогда
			СписокАртикулов.Добавить(АртикулДляПоиска);
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокАртикулов", СписокАртикулов);
		Запрос.УстановитьПараметр("Производитель", Производитель);
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//Маршрутизирует выполнение процесса переноса записей прайс-листа в наиболее оптимальную процедуру
Функция ОбновитьЗаписиВОсновномРегистре(ПрайсЛистКонтрагента, ПорцияЗаписи = Неопределено, КлючСтрокиПоставщика = Неопределено) Экспорт
	Если ПорцияЗаписи = Неопределено Тогда
		ПорцияЗаписи = 9999;
	КонецЕсли;
	Если ТипЗнч(КлючСтрокиПоставщика) = Тип("Строка")
		ИЛИ (ТипЗнч(КлючСтрокиПоставщика) = Тип("Массив") И КлючСтрокиПоставщика.Количество() <= ПорцияЗаписи) Тогда
		Результат = ОбновитьЗаписиПоКлючуСтроки(ПрайсЛистКонтрагента, КлючСтрокиПоставщика);
	Иначе
		Результат = ОбновитьЗаписиВсе(ПрайсЛистКонтрагента, ПорцияЗаписи);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//Выполняет перенос подходящих записей в постоянный регистр по переданным ключам строк
Функция ОбновитьЗаписиПоКлючуСтроки(ПрайсЛистКонтрагента, КлючСтрокиПоставщика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Временный.ПрайсЛист КАК ПрайсЛист,
	|	Временный.КлючСтрокиПоставщика КАК КлючСтрокиПоставщика,
	|	МАКСИМУМ(Временный.АртикулДляПоиска) КАК АртикулДляПоиска,
	|	МАКСИМУМ(Временный.Производитель) КАК Производитель,
	|	МАКСИМУМ(Временный.Наименование) КАК Наименование,
	|	МАКСИМУМ(Временный.НаименованиеИностранное) КАК НаименованиеИностранное,
	|	МАКСИМУМ(Временный.Цена) КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(Временный.Количество КАК БУЛЕВО)) = ИСТИНА
	|				ТОГДА 0
	|			ИНАЧЕ Временный.Количество
	|		КОНЕЦ) КАК Количество,
	|	МАКСИМУМ(Временный.ЗапретПродажи) КАК ЗапретПродажи,
	|	МАКСИМУМ(Временный.ЗапретЗакупки) КАК ЗапретЗакупки,
	|	МАКСИМУМ(Временный.КратностьПоставок) КАК КратностьПоставок,
	|	МАКСИМУМ(Временный.ТегПозиции) КАК ТегПозиции,
	|	МАКСИМУМ(Временный.Валюта) КАК Валюта,
	|	МАКСИМУМ(Временный.СрокПоставкиМинимальный) КАК СрокПоставкиМинимальный,
	|	МАКСИМУМ(Временный.СрокПоставкиМаксимальный) КАК СрокПоставкиМаксимальный,
	|	МАКСИМУМ(Временный.СрокПоставки) КАК СрокПоставки,
	|	МАКСИМУМ(Временный.Артикул) КАК Артикул,
	|	МАКСИМУМ(Временный.СнятаСПроизводства) КАК СнятаСПроизводства,
	|	МАКСИМУМ(Временный.Вес) КАК Вес,
	|	МАКСИМУМ(Временный.Объем) КАК Объем,
	|	МАКСИМУМ(Временный.ПроизводительВПрайсЛисте) КАК ПроизводительВПрайсЛисте,
	|	Временный.ПрайсЛист.Владелец КАК Контрагент
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК Временный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
	|		ПО Временный.ПрайсЛист = ПравилаЗагрузки.ПрайсЛист
	|			И Временный.КлючСтрокиПоставщика = ПравилаЗагрузки.ОбъектПравила
	|			И (ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.КлючСтроки))
	|			И (ПравилаЗагрузки.Значение ССЫЛКА Справочник.Номенклатура)
	|			И ((ВЫРАЗИТЬ(ПравилаЗагрузки.Значение КАК Справочник.Номенклатура)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ЗапретЗагрузкиПроизводитель
	|		ПО Временный.ПрайсЛист = ЗапретЗагрузкиПроизводитель.ПрайсЛист
	|			И (Временный.ПроизводительВПрайсЛисте = (ВЫРАЗИТЬ(ЗапретЗагрузкиПроизводитель.ОбъектПравила КАК СТРОКА(100))))
	|			И (ЗапретЗагрузкиПроизводитель.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте))
	|			И (ЗапретЗагрузкиПроизводитель.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.НеЗагружать))
	|			И (Временный.Производитель = (ВЫРАЗИТЬ(ЗапретЗагрузкиПроизводитель.Значение КАК Справочник.Производители)))
	|ГДЕ
	|	Временный.ПрайсЛист = &ПрайсЛист
	|	И Временный.КлючСтрокиПоставщика В(&КлючиСтрок)
	|	И ((ВЫРАЗИТЬ(Временный.Количество КАК БУЛЕВО)) = ИСТИНА
	|			ИЛИ (ВЫРАЗИТЬ(Временный.Количество КАК ЧИСЛО(15, 3))) > 0)
	|	И Временный.ЗапретЗагрузки = ЛОЖЬ
	|	И (Временный.ПрайсЛист.ВидПрайсЛиста = ЗНАЧЕНИЕ(Перечисление.ВидыПрайсЛистов.ПрайсЛистПоставщика)
	|			ИЛИ Временный.ПрайсЛист.ВидПрайсЛиста = ЗНАЧЕНИЕ(Перечисление.ВидыПрайсЛистов.ОстаткиДляКаталогаПредложений))
	|	И (Временный.АртикулДляПоиска <> """"
	|				И (НЕ Временный.Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
	|					ИЛИ Временный.ПроизводительВПрайсЛисте = """")
	|			ИЛИ НЕ ПравилаЗагрузки.Значение ЕСТЬ NULL )
	|	И ЗапретЗагрузкиПроизводитель.ПрайсЛист ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	Временный.ПрайсЛист,
	|	Временный.КлючСтрокиПоставщика
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючСтрокиПоставщика";
	
	СписокЗначений = Новый СписокЗначений;
	
	Если ТипЗнч(КлючСтрокиПоставщика) = Тип("Массив") Тогда
		СписокЗначений.ЗагрузитьЗначения(КлючСтрокиПоставщика);
	Иначе
		СписокЗначений.Добавить(КлючСтрокиПоставщика);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛистКонтрагента);
	Запрос.УстановитьПараметр("КлючиСтрок", СписокЗначений);
	
	ДатаЗаписиПорцииДанных = ТекущаяДата();
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи.СоздатьМенеджерЗаписи();
		Менеджер.ПрайсЛист = ПрайсЛистКонтрагента;
		Менеджер.ДатаЗаписи = ДатаЗаписиПорцииДанных;
		Менеджер.Записать();
		
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентов");
		ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛистКонтрагента);
		ЭлементБлокировки.УстановитьЗначение("ДатаЗаписи", ДатаЗаписиПорцииДанных);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛистКонтрагента, Истина);
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(ДатаЗаписиПорцииДанных, Истина);
		
		КодПредложения = 0;
		
		ВыборкаЗаписей = Результат.Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗаписей); 
			КодПредложения = КодПредложения + 1;
			НоваяСтрока.ДатаЗаписи = ДатаЗаписиПорцииДанных;
			НоваяСтрока.КодПредложения = КодПредложения;
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	//Удалим из регистра "ПрайсЛистыКонтрагентов" старые записи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист,
	|	ПрайсЛистыКонтрагентов.Номенклатура,
	|	ПрайсЛистыКонтрагентов.АртикулДляПоиска,
	|	ПрайсЛистыКонтрагентов.Производитель,
	|	ПрайсЛистыКонтрагентов.ДатаЗаписи,
	|	ПрайсЛистыКонтрагентов.КодПредложения
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|	И ПрайсЛистыКонтрагентов.КлючСтрокиПоставщика В(&КлючиСтрок)
	|	И ПрайсЛистыКонтрагентов.ДатаЗаписи <> &ДатаЗаписи";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛистКонтрагента);
	Запрос.УстановитьПараметр("КлючиСтрок", СписокЗначений);
	Запрос.УстановитьПараметр("ДатаЗаписи", ДатаЗаписиПорцииДанных);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Результат;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПрайсЛист",        "ПрайсЛист");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДатаЗаписи",       "ДатаЗаписи");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("КодПредложения",   "КодПредложения");
	Блокировка.Заблокировать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить       (ПрайсЛистКонтрагента);
		НаборЗаписей.Отбор.ДатаЗаписи.Установить      (Выборка.ДатаЗаписи);
		НаборЗаписей.Отбор.КодПредложения.Установить  (Выборка.КодПредложения);
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ОтменитьТранзакцию();
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	//Очистим регистр "ПрайсЛистыКонтрагентовНедоступныеЗаписи"
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист",  ПрайсЛистКонтрагента);
	ЭлементБлокировки.УстановитьЗначение("ДатаЗаписи", ДатаЗаписиПорцииДанных);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛистКонтрагента, Истина);
	НаборЗаписей.Отбор.ДатаЗаписи.Установить(ДатаЗаписиПорцииДанных, Истина);
	Попытка
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

//Выполняет перенос всех подходящих записей прайс-листа из временного в постоянный регистр
Функция ОбновитьЗаписиВсе(ПрайсЛистКонтрагента, ПорцияЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ "+Формат(ПорцияЗаписи, "ЧГ=0")+"
	|	Временный.ПрайсЛист,
	|	Временный.КлючСтрокиПоставщика КАК КлючСтрокиПоставщика,
	|	МАКСИМУМ(Временный.АртикулДляПоиска) КАК АртикулДляПоиска,
	|	МАКСИМУМ(Временный.Производитель) КАК Производитель,
	|	МАКСИМУМ(Временный.Наименование) КАК Наименование,
	|	МАКСИМУМ(Временный.НаименованиеИностранное) КАК НаименованиеИностранное,
	|	МАКСИМУМ(Временный.Цена) КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(Временный.Количество КАК БУЛЕВО)) = ИСТИНА
	|				ТОГДА 0
	|			ИНАЧЕ Временный.Количество
	|		КОНЕЦ) КАК Количество,
	|	МАКСИМУМ(Временный.ЗапретПродажи) КАК ЗапретПродажи,
	|	МАКСИМУМ(Временный.ЗапретЗакупки) КАК ЗапретЗакупки,
	|	МАКСИМУМ(Временный.КратностьПоставок) КАК КратностьПоставок,
	|	МАКСИМУМ(Временный.ТегПозиции) КАК ТегПозиции,
	|	МАКСИМУМ(Временный.Валюта) КАК Валюта,
	|	МАКСИМУМ(Временный.СрокПоставкиМинимальный) КАК СрокПоставкиМинимальный,
	|	МАКСИМУМ(Временный.СрокПоставкиМаксимальный) КАК СрокПоставкиМаксимальный,
	|	МАКСИМУМ(Временный.СрокПоставки) КАК СрокПоставки,
	|	МАКСИМУМ(Временный.Артикул) КАК Артикул,
	|	МАКСИМУМ(Временный.СнятаСПроизводства) КАК СнятаСПроизводства,
	|	МАКСИМУМ(Временный.Вес) КАК Вес,
	|	МАКСИМУМ(Временный.Объем) КАК Объем,
	|	МАКСИМУМ(Временный.ПроизводительВПрайсЛисте) КАК ПроизводительВПрайсЛисте,
	|	Временный.ПрайсЛист.Владелец КАК Контрагент
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК Временный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
	|		ПО Временный.ПрайсЛист = ПравилаЗагрузки.ПрайсЛист
	|			И Временный.КлючСтрокиПоставщика = ПравилаЗагрузки.ОбъектПравила
	|			И (ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.КлючСтроки))
	|			И (ПравилаЗагрузки.Значение ССЫЛКА Справочник.Номенклатура)
	|			И ((ВЫРАЗИТЬ(ПравилаЗагрузки.Значение КАК Справочник.Номенклатура)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ЗапретЗагрузкиПроизводитель
	|		ПО Временный.ПрайсЛист = ЗапретЗагрузкиПроизводитель.ПрайсЛист
	|			И (Временный.ПроизводительВПрайсЛисте = (ВЫРАЗИТЬ(ЗапретЗагрузкиПроизводитель.ОбъектПравила КАК СТРОКА(100))))
	|			И (ЗапретЗагрузкиПроизводитель.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте))
	|			И (ЗапретЗагрузкиПроизводитель.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.НеЗагружать))
	|			И (Временный.Производитель = (ВЫРАЗИТЬ(ЗапретЗагрузкиПроизводитель.Значение КАК Справочник.Производители)))
	|ГДЕ
	|	Временный.ПрайсЛист = &ПрайсЛист
	|	И Временный.КлючСтрокиПоставщика > &КлючСтрокиПоставщика
	|	И ((ВЫРАЗИТЬ(Временный.Количество КАК БУЛЕВО)) = ИСТИНА
	|			ИЛИ (ВЫРАЗИТЬ(Временный.Количество КАК ЧИСЛО(15, 3))) > 0)
	|	И Временный.ЗапретЗагрузки = ЛОЖЬ
	|	И (Временный.ПрайсЛист.ВидПрайсЛиста = ЗНАЧЕНИЕ(Перечисление.ВидыПрайсЛистов.ПрайсЛистПоставщика)
	|			ИЛИ Временный.ПрайсЛист.ВидПрайсЛиста = ЗНАЧЕНИЕ(Перечисление.ВидыПрайсЛистов.ОстаткиДляКаталогаПредложений))
	|	И (Временный.АртикулДляПоиска <> """"
	|				И (НЕ Временный.Производитель = ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
	|					ИЛИ Временный.ПроизводительВПрайсЛисте = """")
	|			ИЛИ НЕ ПравилаЗагрузки.Значение ЕСТЬ NULL )
	|	И ЗапретЗагрузкиПроизводитель.ПрайсЛист ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	Временный.ПрайсЛист,
	|	Временный.КлючСтрокиПоставщика
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючСтрокиПоставщика";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛистКонтрагента);
	
	ДатаЗаписиПорцииДанных = ТекущаяДата();
	КлючСтрокиПоставщика = "";
	
	Пока Истина Цикл
		
		Запрос.УстановитьПараметр("КлючСтрокиПоставщика", КлючСтрокиПоставщика);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи.СоздатьМенеджерЗаписи();
		Менеджер.ПрайсЛист = ПрайсЛистКонтрагента;
		Менеджер.ДатаЗаписи = ДатаЗаписиПорцииДанных;
		Менеджер.Записать();
		
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентов");
		ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛистКонтрагента);
		ЭлементБлокировки.УстановитьЗначение("ДатаЗаписи", ДатаЗаписиПорцииДанных);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛистКонтрагента);
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(ДатаЗаписиПорцииДанных);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		КодПредложения = 0;
		
		ВыборкаЗаписей = Результат.Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗаписей); 
			КодПредложения = КодПредложения + 1;
			НоваяСтрока.КодПредложения = КодПредложения;
			НоваяСтрока.ДатаЗаписи = ДатаЗаписиПорцииДанных;
			КлючСтрокиПоставщика = ВыборкаЗаписей.КлючСтрокиПоставщика;
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			Возврат Ложь;
		КонецПопытки;
		
		Если ТекущаяДата() <= ДатаЗаписиПорцииДанных Тогда
			ДатаЗаписиПорцииДанных = ДатаЗаписиПорцииДанных + 1;
		Иначе
			ДатаЗаписиПорцииДанных = ТекущаяДата();
		КонецЕсли;
		
	КонецЦикла;
	
	//Удалим из регистра "ПрайсЛистыКонтрагентов" старые записи
	//Получим все даты записей из регистра "ПрайсЛистыКонтрагентов",
	//которых нет в "ПрайсЛистыКонтрагентовНедоступныеЗаписи"
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрайсЛистыКонтрагентов.ДатаЗаписи
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи КАК НедоступныеЗаписи
	|		ПО НедоступныеЗаписи.ПрайсЛист = ПрайсЛистыКонтрагентов.ПрайсЛист
	|			И НедоступныеЗаписи.ДатаЗаписи = ПрайсЛистыКонтрагентов.ДатаЗаписи
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|	И НедоступныеЗаписи.ДатаЗаписи ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛистКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентов");
		ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛистКонтрагента);
		ЭлементБлокировки.УстановитьЗначение("ДатаЗаписи", Выборка.ДатаЗаписи);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛистКонтрагента);
		НаборЗаписей.Отбор.ДатаЗаписи.Установить(Выборка.ДатаЗаписи);
		Попытка
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	//Очистим регистр "ПрайсЛистыКонтрагентовНедоступныеЗаписи"
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛистКонтрагента);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовНедоступныеЗаписи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛистКонтрагента, Истина);
	Попытка
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции
